#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

In [3]:
data=[4,8,15,16,23,42]

In [4]:
series=pd.Series(data)

In [5]:
print (series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [6]:
lst=[1,2,3,4,5,6,7,8,9,10]

In [7]:
print(pd.Series(lst))

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

#### Q3. Create a Pandas DataFrame that contains the following data:

|Name|Age|Gender|
|---|---|---|
|Alice|25|Female|
|Bob|30|Male|
|Claire|27|Female|

In [8]:
d=[['Alice',25,'Female'],
['Bob',30,'Male'],
['Claire',27,'Female']]

In [15]:
df=pd.DataFrame(d,columns=['Name','Age','Gender'])

In [16]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Dataframe is a 2 dimensional data structure like table with rows and columns.The size and values of a dataframe is mutable. It is created by using function pandas.DataFrame().

Series are 1 dimensional arrays that can hold data of any type. It is created by using a function pandas.Series().

In this way dataframe differs from the series.

In [11]:
#e.g.

# Creating a Series
s = pd.Series([1, 2, 3, 4, 5])
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [23]:
# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'London', 'Paris']}
df = pd.DataFrame(data)
print(df)

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Some of the common functions used to manipulate data in Panda Dataframe are:

In [35]:
#pandas.DataFrame(): To create a data frame.
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'London', 'Paris']}
df1 = pd.DataFrame(data)
print(df1)

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [36]:
#<dataframe variable>.head(): To extract req. no. of data from the top.

df1.head(1)

    Name  Age      City
0  Alice   25  New York

In [37]:
#<dataframe variable>.tail(): To extract req. no. of data from the bottom.

df1.tail(1)

      Name  Age   City
2  Charlie   35  Paris

In [38]:
#<dataframe variable>.dtypes: To extract type of each column inside the dataframe.

df1.dtypes

Name    object
Age      int64
City    object
dtype: object

In [39]:
#<dataframe variable>.insert(): To insert a column.

df1.insert(1,'Gender',['Female','Male','Male'])
print(df1)

      Name  Gender  Age      City
0    Alice  Female   25  New York
1      Bob    Male   30    London
2  Charlie    Male   35     Paris

In [41]:
#<dataframe variable>.drop(): To delete a column.

df1.drop(columns='Gender')

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [43]:
#<dataframe variable>.to_<file type>('file name'): To store dataframe in local memory.

df1.to_csv('first_data_frame.csv',index=False)

In [44]:
#pandas.read_<file type>('file name'): To read data from existing file.

pd.read_csv('first_data_frame.csv')

      Name  Gender  Age      City
0    Alice  Female   25  New York
1      Bob    Male   30    London
2  Charlie    Male   35     Paris

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series and Dataframe are mutable wherease Panel is immutable.

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [46]:
# Series
s1 = pd.Series([1, 2, 3])
s2 = pd.Series(['A', 'B', 'C'])

print(type(s1),type(s2))

<class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'>

In [47]:
# Dataframe from series
data = {'Column1': s1, 'Column2': s2}
df = pd.DataFrame(data)

print(type(df))

<class 'pandas.core.frame.DataFrame'>

Here s1 and s2 are series as seen in the example and are merged together using pandas.DataFrame() function to create a dataframe.